==================
Expression-1.1 `number`
==================
test = 0
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (unsigned))))))

==================
Expression-1.1 `number`
==================
test = 10
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (unsigned))))))

==================
Expression-2.1 `string`
==================
test = "s"
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (string))))))

==================
Expression-2.2 `string`
==================
test = "\s"
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (string))))))

==================
Expression-3.1 `set`
==================
test = \p{XID_Start}
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (regex_set))))))

==================
Expression-4.1 `range`
==================
test = [0]
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (regex_range
            (regex_range_item)))))))

==================
Expression-4.2 `range`
==================
test = [0-1]
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (regex_range
            (regex_range_item
              (regex_range_item_group
                (regex_range_item)
                (regex_range_item)))))))))

==================
Expression-4.3 `range`
==================
test = [0-1]
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (regex_range
            (regex_range_item
              (regex_range_item_group
                (regex_range_item)
                (regex_range_item)))))))))

==================
Expression-4.4 `range`
==================
test = [_0-9a-zA-Z]
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (regex_range
            (regex_range_item)
            (regex_range_item
              (regex_range_item_group
                (regex_range_item)
                (regex_range_item)))
            (regex_range_item
              (regex_range_item_group
                (regex_range_item)
                (regex_range_item)))
            (regex_range_item
              (regex_range_item_group
                (regex_range_item)
                (regex_range_item)))))))))


==================
Expression-4.5 `range`
==================
test = [^ _]
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (regex_range
            (regex_range_item)
            (regex_range_item)))))))

==================
Expression-5.1 `regex`
==================
test = /i/i
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (data
          (regex_long
            (ERROR
              (id)))))))
  (ERROR
    (id)))

